import numpy as np

print("************ Завдання 1 *******************")
# Завдання 1. Напишіть програму, яка просить користувача ввести координати та визначити, чи належать вони до затіненої області.
x = float(input("Введіть координату x: "))
y = float(input("Введіть координату y: "))

if x ** 2 + y ** 2 <= 1 and abs(x) + abs(y + np.sqrt(2) / 2) >= np.sqrt(2) / 2:
    print("Координати належать до затіненої області.")
else:
    print("Координати не належать до затіненої області.")

print("********************************************")
print()
