import textwrap

print("************ Завдання 4 *******************")
# Завдання 4. Поміняйте місцями N слово й 20-N слово у речені (знаки пунктуації залишати на місці)

# Вхідне речення
sentence = "Програміст — фахівець, що займається програмуванням, виконує розробку програмного \
 забезпечення (в простіших випадках — окремих програм) для програмованих пристроїв, \
 які, як правило містять один процесор чи більше"

N = int(input("Введіть значення N: "))

print("Before changes: ", textwrap.fill(sentence, width=80))

# Розділіть речення на слова
words = sentence.split()

if N < len(words) // 2:
    # Обміняйте N-е слово і (20-N)-е слово
    words[N - 1], words[20 - N - 1] = words[20 - N - 1].upper(), words[N - 1].upper()

# Знову об'єднайте слова у речення
new_sentence = " ".join(words)
print()
print("After changes: ", textwrap.fill(new_sentence, width=80))
print("********************************************")
