import random

print("************ Завдання 3 *******************")
# Завдання 3.  У вас є список із N+10 чисел. Встановіть на перше місце (в передній частині списку) останній елемент і навпаки.

# Використання зрізів (slices)
N = int(input("Введіть значення N: "))

print(" Переміщення місцями останнього елементу з першим за допомогою зрізів")

numbers = [random.randint(1, 100) for _ in range(N + 10)]
print("Вхідний масив: ", numbers)

# Заміна першого елемента на останній
numbers[0], numbers[-1] = numbers[-1], numbers[0]

print("Масив після заміни елементів за допомогою зрізів: ", numbers)

print("\n Переміщення останнього елементу на початок масиву методами inset() та pop(): ")
numbers_array = [random.randint(1, 100) for _ in range(N + 10)]

print("Вхідний масив: ", numbers_array)
# Переміщення останнього елементу на початок масиву
numbers_array.insert(0, numbers_array.pop(-1))
print("Масив після переміщення останнього елементу на початок масиву методами inset() та pop(): ", numbers_array)

# Переміщення першого елементу в кінець масиву
print("\n Переміщення першого елементу в кінець масиву методами append() та pop(): ")  # Повертаємо значення видаленого елементу
array_numbers = [random.randint(1, 100) for _ in range(N + 10)]
print("Вхідний масив: ", array_numbers)
array_numbers.append(array_numbers.pop(0))
print("Масив після переміщення першого елементу в кінець масиву методами append() та pop(): ", array_numbers)

print("********************************************")